касса_Вегас/src/Catalogs/ДрайверыОборудования/ДрайверыОборудования.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:Catalog>
  <name>ДрайверыОборудования</name>
  <predefined>
    <items>
      <name>Драйвер1ССканерШтрихкода</name>
      <description>1С:Cканер штрихкода (Native)</description>
    </items>
    <items>
      <name>Драйвер1СДисплейПокупателяWin</name>
      <description>1С:Дисплей покупателя (Windows)</description>
    </items>
    <items>
      <name>Драйвер1СДрайверFPrint11</name>
      <description>1С:Драйвер FPrint-11</description>
    </items>
    <items>
      <name>Драйвер1СПринтерЧеков</name>
      <description>1С:Принтер чеков</description>
    </items>
    <items>
      <name>Драйвер1СУстройствоВвода</name>
      <description>1С:Устройство ввода</description>
    </items>
    <items>
      <name>ДрайверIboxProПлатежнаяСистема</name>
      <description>2Can:Сервис приема платежей</description>
    </items>
    <items>
      <name>ДрайверCASЭлектронныеВесыWin</name>
      <description>CAS:Электронные весы (Windows)</description>
    </items>
    <items>
      <name>ДрайверRightScanККТ54ФЗ</name>
      <description>RightScan:ККТ с передачей данных в ОФД (54-ФЗ)</description>
    </items>
    <items>
      <name>ДрайверRightScanУстройстваВвода</name>
      <description>RightScan:Устройства ввода данных ТСД Urovo</description>
    </items>
    <items>
      <name>ДрайверRightScanУстройствоПечати</name>
      <description>RightScan:Устройство печати ТСД Urovo</description>
    </items>
    <items>
      <name>ДрайверScanPortУстройстваВвода</name>
      <description>ScanPort:Устройства ввода данных</description>
    </items>
    <items>
      <name>ДрайверАЗУРККТ54ФЗ</name>
      <description>АЗУР:ККТ с передачей данных в ОФД (54-ФЗ)</description>
    </items>
    <items>
      <name>ДрайверАЗУРПлатежнаяСистема</name>
      <description>АЗУР:Платежная система</description>
    </items>
    <items>
      <name>ДрайверАТОЛККТ54ФЗ9X</name>
      <description>АТОЛ:ККТ с передачей данных в ОФД (54-ФЗ)</description>
    </items>
    <items>
      <name>ДрайверАТОЛККТ54ФЗ10X</name>
      <description>АТОЛ:ККТ с передачей данных в ОФД (54-ФЗ) 10.x</description>
    </items>
    <items>
      <name>ДрайверАТОЛЭлектронныеВесыWin</name>
      <description>АТОЛ:Электронные весы (Windows)</description>
    </items>
    <items>
      <name>ДрайверВерсияТККТ54ФЗ</name>
      <description>Версия-Т:ККТ с передачей данных в ОФД (54-ФЗ)</description>
    </items>
    <items>
      <name>ДрайверInpasПлатежнаяСистема</name>
      <description>ИНПАС:Эквайринг-терминал</description>
    </items>
    <items>
      <name>ДрайверСканситиУстройстваВвода</name>
      <description>СКАН СИТИ:Устройства ввода данных</description>
    </items>
    <items>
      <name>ДрайверСканкодСканерШтрихкода</name>
      <description>СКАНКОД:Cканер штрихкода Chipherlab (Native)</description>
    </items>
    <items>
      <name>ДрайверШтрихМККТ54ФЗ</name>
      <description>Штрих-М:ККТ с передачей данных в ОФД (54-ФЗ)</description>
    </items>
    <items>
      <name>ДрайверШтрихМККТ54ФЗWin</name>
      <description>Штрих-М:ККТ с передачей данных в ОФД (Windows)</description>
    </items>
  </predefined>
  <attributes>
    <name>ТипОборудования</name>
    <type>
      <types>EnumRef.ТипыПодключаемогоОборудования</types>
    </type>
  </attributes>
  <attributes>
    <name>ИдентификаторОбъекта</name>
    <type>
      <types>String</types>
    </type>
  </attributes>
  <attributes>
    <name>УстановкаИзМакета</name>
    <type>
      <types>Boolean</types>
    </type>
  </attributes>
  <attributes>
    <name>ВерсияДрайвера</name>
    <type>
      <types>String</types>
      <stringQualifiers>
        <length>16</length>
      </stringQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>ИнтеграционноеПриложение</name>
    <type>
      <types>Boolean</types>
    </type>
  </attributes>
</mdclass:Catalog>

касса_Вегас/src/Catalogs/ДрайверыОборудования/Forms/ФормаЭлемента/Module.bsl
#Область ОбработчикиСобытийФорм

&НаСервере
Процедура ПриСозданииНаСервере(Отказ, СтандартнаяОбработка)
	
	ПоставляемыйВСоставеКонфигурации = Объект.Предопределенный;
	
	Элементы.ТипОборудования.ТолькоПросмотр = ПоставляемыйВСоставеКонфигурации;
	Элементы.Наименование.ТолькоПросмотр = ПоставляемыйВСоставеКонфигурации;
	Элементы.ИдентификаторОбъекта.ТолькоПросмотр = ПоставляемыйВСоставеКонфигурации;
	Элементы.ТипДрайвера.ТолькоПросмотр = ПоставляемыйВСоставеКонфигурации;
	
	Элементы.ЗаписатьИЗакрыть.Видимость = НЕ ПоставляемыйВСоставеКонфигурации;
	Элементы.ФормаЗакрыть.Видимость = ПоставляемыйВСоставеКонфигурации;
	Элементы.ФормаЗакрыть.КнопкаПоУмолчанию = Элементы.ФормаЗакрыть.Видимость;
	
	МенеджерОборудованияВызовСервера.ПодготовитьЭлементУправления(Элементы.Наименование);
	МенеджерОборудованияВызовСервера.ПодготовитьЭлементУправления(Элементы.ТипОборудования);
	МенеджерОборудованияВызовСервера.ПодготовитьЭлементУправления(Элементы.ИдентификаторОбъекта);
	МенеджерОборудованияВызовСервера.ПодготовитьЭлементУправления(Элементы.ТипДрайвера);
	МенеджерОборудованияВызовСервера.ПодготовитьЭлементУправления(Элементы.ВерсияДрайвера);
	
КонецПроцедуры

&НаКлиенте
Процедура УстановитьДрайвер(Команда)
	
	МенеджерОборудованияКлиент.УстановитьДрайверИзМакета(Объект.Ссылка);
	
КонецПроцедуры

#КонецОбласти
